app/models/theatre.rb

  def self.how_many
    return self.all.count
---
SELECT COUNT(*) FROM "theatres"